[
    {
        "id": "11495a4e-2e1f-4a95-ba7f-6154ed34e1a1",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "C++ Software Engineer - Battlefield Central Tech",
        "company": "DICE",
        "location": "Sweden",
        "skills": [
            "c++",
            "unreal engine",
            "windows api",
            "rust"
        ],
        "industry": "Software",
        "description": "We are a global team of creators, storytellers, technologists, experience originators, innovators and so much more. We believe amazing games and experiences start with teams as diverse as the players and communities we serve. At Electronic Arts, the only limit is your imagination.\n\nWe are looking for people to join our team building core, impactful, and empowering technology for Battlefield. Our Battlefield Technology Team is home to remarkable technical talent building Battlefield tools and technology on EA’s proprietary game engine, Frostbite. We aim to empower engineering and content creation with a myriad of tools and workflows, while empowering the multi-studio distributed development team to create connected experiences for Battlefield fans around the world. Our people are the backbone and driving force to our creative products, and that’s why we’re dedicated to providing everyone the chance to express themselves and be their very best as we work towards a common cause. Join us!\n\nAs an Online Software Engineer, you implement solutions connecting millions of players in our online multiplayer games. You will design and develop online features such as friend invites, matchmaking, progression and in-game store for DICE's future titles. We ask that you understand the different network topologies used in gaming and interaction with the different online services powering DICE games. As a part of our game team, you are expected to write high-performing systems with limited hardware and networking requirements to ensure great user experience for the players. You will report into a Development Director.\n\nYou will work at the office located in Stockholm with the possibility to hybrid work 2 -3 days a week.\n\n\nResponsibilities\n\nYou will work with game design, user experience, product and analytics teams to identify online system's needs, evaluate requirements, write specifications, and design and implement complex systems and interfaces.\nWrite well designed, efficient and testable software.\nWork toward excellence in software craftsmanship, and work with peers to improve software design\nExchange knowledge and experiences with fellow engineers on relevant modern technologies and on best practices for developing online systems.\n\n\nRequirement\n\nYou probably have experience working on complex consumer software products. You are comfortable talking to us about:\n\nAlgorithms, design patterns, debugging and memory/performance optimization.\nDistributed real-time systems with high performance and reliability\n\n\nOther Skills\n\n5+ years of experience with C/C++\nArchitectural knowledge in different network topologies used in gaming\nIf you are interested in gaming or experience from the gaming industry - great!\nAbout Electronic Arts\n\nEverything we do is designed to inspire the world to play. Through our cutting-edge games, innovative services, and powerful technologies, we bring worlds with infinite possibilities to millions of players and fans around the globe.\n\nWe’re looking for collaborative and inclusive people with diverse perspectives who will enrich our culture and challenge us. We take a holistic approach with our benefits program, focusing on physical, emotional, financial, career, and community wellness to support our people through every chapter of life. Our goal is to provide a safe and respectful workplace that empowers you to thrive in both work and life.\n\nElectronic Arts is an equal opportunity employer. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. We will also consider employment qualified applicants with criminal records in accordance with applicable law. EA also makes workplace accommodations for qualified individuals with disabilities as required by applicable law.",
        "remote": false,
        "remote_eligible": false,
        "apply_link": "https://dise.se",
        "premium": 0,
        "updated_at": "2023-05-11T20:40:19.996354+00:00",
        "created_at": "2023-05-01T20:40:19+00:00",
        "verified": true,
        "type": "Internship",
        "experience_level": "Entry",
        "keywords": null
    },
    {
        "id": "bda64a62-559a-4b75-96e5-449c18c8e6d0",
        "user_id": "6dbb649f-2f1a-4520-8afc-b5e39ce6e970",
        "title": "Network Engineer",
        "company": "Google",
        "location": "Sweden",
        "skills": [
            "go",
            "terraform",
            "gcp",
            "linux",
            "ansible",
            "firebase"
        ],
        "industry": "Software Development",
        "description": "We are looking for a network engineer to join Google Map service.",
        "remote": false,
        "remote_eligible": false,
        "apply_link": "https://google.com",
        "premium": 1,
        "updated_at": "2023-05-11T17:54:05.617596+00:00",
        "created_at": "2023-05-01T17:54:05+00:00",
        "verified": true,
        "type": "Contract",
        "experience_level": "Mid-Senior",
        "keywords": null
    },
    {
        "id": "086e81fe-6fa2-4274-9506-55013fd74a7e",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Software Engineer",
        "company": "Docker",
        "location": "Sweden",
        "skills": [
            "go",
            "terraform",
            "docker",
            "kubernetes"
        ],
        "industry": "Software",
        "description": "We are looking for a software engineer to join our team at Docker.",
        "remote": true,
        "remote_eligible": true,
        "apply_link": "https://docker.com",
        "premium": 0,
        "updated_at": "2023-05-11T17:52:27.489552+00:00",
        "created_at": "2023-05-11T17:52:27.489552+00:00",
        "verified": true,
        "type": "Full-time",
        "experience_level": "Senior",
        "keywords": null
    },
    {
        "id": "c6401a43-9cac-4274-9b93-0033d4539885",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Manager, Engineering I - GCP Integrations",
        "company": "Datadog",
        "location": "United States",
        "skills": [
            "go",
            "c++",
            "java"
        ],
        "industry": "Engineering",
        "description": "About Datadog:\n\nWe're on a mission to build the best platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—allowing for seamless collaboration and problem-solving among Dev, Ops and Security teams globally for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to solve hard problems the right way.\n\n \n\nDatadog is looking for an Engineering Manager to lead and grow the engineering team building out our high-scale integrations with Google Cloud. As an Engineering Manager, you’ll be responsible for managing a team of talented engineers to expand and maintain our API integrations with Google Cloud and other emerging clouds. The team owns multiple mission critical services contributing to the Infrastructure Monitoring product, as well as partners with other teams to expand support for Google Cloud (and others) throughout the Datadog platform.\n\n \n\nAt Datadog, we place value in our office culture - the relationships and collaboration it builds and the creativity it brings to the table. We operate as a hybrid workplace to ensure our Datadogs can create a work-life harmony that best fits them.\n\n \n\nWhat You’ll Do:\n\n    Manage and grow the engineering team: developing their skills, supporting their careers, and recruiting additional team members.\n    Be technically involved with the team: setting technical direction, contributing to or driving architectural discussions, reviewing RFCs, reviewing pull requests and sometimes contributing code yourself.\n    Partner with other teams and stakeholders within Datadog to shape our roadmap.\n\n \n\nWho You Are:\n\n    You have experience working in a strongly-typed language, such as Go, Java, or C++\n    You have direct people management experience and are passionate about building a great team culture\n    You have a proven track record of executing and delivering \n    You have built and maintained systems at scale\n    You have some experience working in the cloud\n    You have experience communicating and collaborating with other teams and stakeholders \n\n \n\nDatadog values people from all walks of life. We understand not everyone will meet all the above qualifications on day one. That's okay. If you’re passionate about technology and want to grow your skills, we encourage you to apply.\n\n \n\nBenefits and Growth:\n\n    New hire stock equity (RSUs) and employee stock purchase plan (ESPP)\n    Continuous professional development, product training, and career pathing\n    Intradepartmental mentor and buddy program for in-house networking\n    An inclusive company culture, ability to join our Community Guilds (Datadog employee resource groups)\n    Access to Inclusion Talks, our internal panel discussions\n    Free, global mental health benefits for employees and dependents age 6+\n    Competitive global benefits\n\n\nBenefits and Growth listed above may vary based on the country of your employment and the nature of your employment with Datadog.\n\n \n\nThe reasonably estimated salary for this role at Datadog ranges from $187,000 to $240,000, plus a competitive equity package, and may include variable compensation. Actual compensation is based on factors such as the candidate's skills, qualifications, and experience. In addition, Datadog offers a wide range of best in class, comprehensive and inclusive employee benefits for this role including healthcare, dental, parental planning, and mental health benefits, a 401(k) plan and match, paid time off, fitness reimbursements, and a discounted employee stock purchase plan.\n\n#LI-BJ1\n\nAbout Datadog: \n\nDatadog (NASDAQ: DDOG) is a global SaaS business, delivering a rare combination of growth and profitability. We are on a mission to break down silos and solve complexity in the cloud age by enabling digital transformation, cloud migration, and infrastructure monitoring of our customers’ entire technology stacks. Built by engineers, for engineers, Datadog is used by organizations of all sizes across a wide range of industries. Together, we champion professional development, diversity of thought, innovation, and work excellence to empower continuous growth. Join the pack and become part of a collaborative, pragmatic, and thoughtful people-first community where we solve tough problems, take smart risks, and celebrate one another. Learn more about #DatadogLife on Instagram, LinkedIn and Datadog Learning Center.\n\nEqual Opportunity at Datadog:\n\nDatadog is an Affirmative Action and Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.\n\nYour Privacy:\n\nAny information you submit to Datadog as part of your application will be processed in accordance with Datadog’s Applicant and Candidate Privacy Notice.",
        "remote": true,
        "remote_eligible": true,
        "apply_link": "https://careers.datadoghq.com/detail/5009852/?gh_jid=5009852",
        "premium": 0,
        "updated_at": "2023-05-13T00:15:21.311745+00:00",
        "created_at": "2023-05-13T00:15:21.311745+00:00",
        "verified": true,
        "type": "Full-time",
        "experience_level": "Entry",
        "keywords": null
    },
    {
        "id": "fc59cd24-a792-47f0-a27a-a7c75767ad54",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Chief of Staff, Office of the CEO",
        "company": "Hashicorp",
        "location": "United States",
        "skills": [
            "consulting",
            "investment banking",
            "chief"
        ],
        "industry": "Software",
        "description": "About the role...\n\nWe are looking for a Chief of Staff for a key role in the Office of the CEO in our San Francisco office. This role will be instrumental in architecting the CEO’s engagement with customers and key partners from selection to planning and preparation. The Chief of Staff will also support the CEO in critical aspects of supporting the HashiCorp Leadership Team and Board of Directors engagement. The ideal candidate will have experience in fast-paced environments and the ability to manage many priorities at once. Self- motivated and able to determine what needs to be done paired with an ability to drive results is key. The ideal candidate will be able to understand the strategy of the business, curious to learn new things and the ability to integrate diverse information into a coherent story. They will have the ability to partner with many different constituencies across the organization and have the finesse to work on behalf of the CEO. \n\nIn this role you can expect to...\n\nDrive all aspects of CEO engagement with the client base:\n\n    Drive selection of key customers / prospects for CEO engagement in partnership with Sales; ensure an analytical approach to selection including ongoing refinement of criteria. \n    Optimize the CEO’s schedule around 300 client meetings per year. Take into consideration other CEO commitments and travel to drive efficiency. \n    Partner with Sales to ensure appropriate contacts at client / prospect are available. \n    Work with EA to ensure all logistics are addressed accurately. \n    Own preparation for client meetings, including company information, key players, dynamics in the account, HashiCorp relationship, any issues, etc. Access and integrate information from the Sales team, internal systems, public information, and other sources.\n\nOversee CEO engagement with external ecosystem partners: \n\n    Own selection of key Partners for CEO engagement. \n    Determine timing of Partner meetings with CEO and ensure EA executes. \n    Responsible for preparation for Partner meetings including information on the company, key players, trends, interaction with HashiCorp.\n    Document outcomes of meetings and integrate into broader learnings and share within the organization as necessary. \n\nDrive Leadership Team strategic meetings and offsites: \n\n    Develop cadence for executive team meetings. \n    Work with the CEO and leadership team to set an agenda for each meeting.\n    Partner with the leadership team to develop materials for meetings.\n    Track follow ups and open items from meetings to ensure closure.\n\nOversee Board of Directors Engagement:\n\n    Understand overall Board agenda and ensure materials are prepared by teams across the organization \n    Support CEO in all aspects of preparation for Board Meetings \n    Facilitate key interactions with individual Board members between meetings\n\nYou may be a good fit for our team if you have...\n\n    5+ years of experience in consulting, investment banking or as a Chief of Staff \n    Strong analytical and presentation skills \n    Keen motivation to figure out what needs to be done and demonstrated ability to execute in a complex environment and overcome any hurdles. \n    Flexibility to balance multiple workstreams and handle changing priorities. \n    Curious to learn new information; ability to integrate diverse, complex information into a coherent story or framework. \n    Strong interpersonal skills and experience working cross functionally.\n    Experience working with senior executives. \n    Discretion and sound judgment when working with sensitive and confidential information. \n    Strong detail orientation and ability to handle complex scheduling, coordinating many people across the organization and externally.\n    Strategic insight, attuned to overall business dynamics; able to understand critical issues in key client relationships.\n    Open-minded and eager to understand different points. \n    Understanding of cloud infrastructure software.\n    Experience working with Sales teams.\n    Must be based in the San Francisco Bay Area and \n\n#LI-Onsite (exclude if not applicable)\n\nColorado, California, Washington and New York City Applicants: To view base salary ranges for this role in your location and to learn more about which roles are eligible for bonus pay or commissions, please visit our Pay Transparency Calculator below. Individual pay within the range will be determined based on job related-factors such as skills, experience, and education or training. Information on our benefits can be found via the link below. Intern ranges can be found below.\n\n    Pay Transparency Calculator: https://bit.ly/3B7gwql\n    Benefits: https://www.hashicorp.com/careers/benefits\n    Intern Ranges: https://bit.ly/3H2soha\n",
        "remote": false,
        "remote_eligible": false,
        "apply_link": "https://www.hashicorp.com/career/4968063",
        "premium": 1,
        "updated_at": "2023-05-13T00:19:13.42344+00:00",
        "created_at": "2023-05-13T00:19:13.42344+00:00",
        "verified": true,
        "type": "Full-time",
        "experience_level": "Senior",
        "keywords": null
    },
    {
        "id": "eed4c0d8-3b4f-472b-964b-e6ba3b6d86e6",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Senior Threat Detections Engineer - Reddit Security Intelligence Center",
        "company": "Reddit",
        "location": "United States",
        "skills": [
            "data",
            "security",
            "splunk",
            "malware",
            "threat hunting"
        ],
        "industry": "Software",
        "description": "Reddit is a community of communities where people can dive into anything through experiences built around their interests, hobbies, and passions. Our mission is to bring community, belonging, and empowerment to everyone in the world. Reddit users submit, vote, and comment on content, stories, and discussions about the topics they care about the most. From pets to parenting, there’s a community for everybody on Reddit and with over 50 million daily active users, it is home to the most open and authentic conversations on the internet. For more information, visit redditinc.com.\n\nThe Reddit Security Intelligence Center (RSIC) is seeking a Senior Threat Detections Engineer. This is an opportunity to have an outsized impact on a highly skilled and motivated team. We look for humble experts with a relentlessly resourceful and entrepreneurial “can do” view of security. RSIC engineers manage the data pipeline, analyze security threats, build detections, and respond to security events. We value broad and deep technical knowledge, specifically in the fields of data analytics, system forensics, malware analysis, threat hunting, threat intelligence, and application, endpoint, & infrastructure security.\n\nIf you are passionate about data, security, threat models, and building creative mitigations, we need you. The ideal candidate has worked as part of a Computer Security Incident Response Team (CSIRT) and has extensive experience building creative detections, mapping detections to various security models, and deriving actionable intelligence to provide high fidelity alerting. You will help build a scalable detection and incident response system to analyze security events and find anomalies across Reddit’s technical ecosystem (endpoints, cloud, and SaaS).\n\nWhat You'll Do:\n\nIdentify and implement high-quality detections, playbooks, and solutions that improve Reddit’s detection and response capabilities\nEvaluate the impact of current security trends, advisories, publications, and academic research, coordinating detection and response as necessary\nDrive actionability to detections and take feedback from incident response across multiple cross-functional teams\nWork alongside and mentor engineers to improve security and reduce risk\nInfluence the collection of telemetry and observability spanning sources like endpoints (Mac, Windows, Linux), Cloud (AWS and GCP), Kubernetes, and SaaS applications.\nKeep your knowledge and skills current with the rapidly changing threat landscape\nParticipate in an on-call rotation (high fidelity detections matter)\nWhat We Can Expect From You:\n\n5+ years of demonstrated experience analyzing data, writing detections, and leading security incident response\nHands on expertise with Splunk SIEM & SOAR solutions, with deep experience in developer Risked Based Alerting (RBA)\nProficient in threat hunting hypothesis forming and evaluation, and evidence gathering and coalescence\nTechnical depth in one or more specialties including: application security, cloud infrastructure security, digital forensics, malware analysis, threat hunting or some combination thereof\nStrong understanding of security vulnerabilities, attacker exploit techniques, and methods for their remediation\nDeep knowledge of various endpoint operating systems, security tools, cloud providers, and architecture designs\nDemonstrated knowledge of security data pipeline architecture designs\nRelevant industry certifications from SANS, SIEM vendors, etc.\nExcellent communication and collaborative skills\nAbility to work with a high degree of autonomy\nBenefits:\n\nComprehensive Health benefits\n401k Matching \nWorkspace benefits for your home office\nPersonal & Professional development funds\nFamily Planning Support\nFlexible Vacation & Reddit Global Days Off\n4+ months paid Parental Leave  \nPaid Volunteer time off\nPay Transparency:\n\nThis job posting may span more than one career level.\n\nIn addition to base salary, this job is eligible to receive equity in the form of restricted stock units, and depending on the position offered, it may also be eligible to receive a commission. Additionally, Reddit offers a wide range of benefits to U.S.-based employees, including medical, dental, and vision insurance, 401(k) program with employer match, generous time off for vacation, and parental leave. To learn more, please visit https://www.redditinc.com/careers/.\n\nTo provide greater transparency to candidates, we share base pay ranges for all US-based job postings regardless of state. We set standard base pay ranges for all roles based on function, level, and country location, benchmarked against similar stage growth companies. Final offer amounts are determined by multiple factors including, skills, depth of work experience and relevant licenses/credentials, and may vary from the amounts listed below.\n\nThe base pay range for this position is: $145,700 - $218,600.\n\nReddit is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at ApplicationAssistance@Reddit.com.",
        "remote": true,
        "remote_eligible": true,
        "apply_link": "https://boards.greenhouse.io/reddit/jobs/5025321#app",
        "premium": 0,
        "updated_at": "2023-05-13T02:49:02.686833+00:00",
        "created_at": "2023-05-13T02:49:02.686833+00:00",
        "verified": false,
        "type": "Contract",
        "experience_level": "Senior",
        "keywords": null
    },
    {
        "id": "b1df85c0-20a4-46af-8e66-02709dc09e36",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Director of Engineering, Ads Measurement",
        "company": "Reddit",
        "location": "United States",
        "skills": [
            "management",
            "scrum",
            "agile",
            "business development"
        ],
        "industry": "Software Development",
        "description": "Reddit is a community of communities where people can dive into anything through experiences built around their interests, hobbies, and passions. Our mission is to bring community, belonging, and empowerment to everyone in the world. Reddit users submit, vote, and comment on content, stories, and discussions about the topics they care about the most. From pets to parenting, there’s a community for everybody on Reddit and with over 50 million daily active users, it is home to the most open and authentic conversations on the internet. For more information, visit redditinc.com.\n\nReddit is continuing to grow our teams with the best talent. This role is completely remote friendly and will continue to be after the pandemic. \n\nOur Ads Measurement organization currently consists of two teams: Ads Measurement Core, which focuses on infrastructure and attribution, and Ads Measurement Signals, responsible for signal collection via pixel or APIs and advertiser-facing event manager products. In the future, we plan to expand by creating two additional teams. The first, Performance Measurement and Experiments, will focus on studies such as conversion and brand lift. The second, Modeled Conversions and Privacy Preserved Measurement, will focus on developing models for privacy-preserved measurement. By joining our Ads Measurement team, you will be part of a dynamic and innovative organization that is committed to driving business success through the development of cutting-edge measurement solutions.\n\nWe are seeking an experienced engineering leader to oversee all Ads Measurement teams, with the objective of enhancing our ads business performance through the development, optimization, and innovation of ads measurement products, services, and models. The ideal candidate will possess the following capabilities:\n\nBroad understanding of the technical landscape of ads measurement, with deep knowledge in at least one or two areas, such as signals, attribution, modeling, or infra.\nFamiliarity with the technical challenges posed by privacy regulations and the ability to navigate them effectively.\nA seasoned senior people manager with experience managing multiple teams.\nA proven ability to drive strong and large-scale cross-functional collaborations.\nStrong background in DS and/or applied ML is a plus.\nBenefits:\n\nComprehensive Health benefits\n401k Matching\nWorkspace benefits for your home office\nPersonal & Professional development funds\nFamily Planning Support\nFlexible Vacation (please use them!) & Reddit Global Days Off\n4+ months paid Parental Leave\nPaid Volunteer time off\nPay Transparency:\n\nThis job posting may span more than one career level.\n\nIn addition to base salary, this job is eligible to receive equity in the form of restricted stock units, and depending on the position offered, it may also be eligible to receive a commission. Additionally, Reddit offers a wide range of benefits to U.S.-based employees, including medical, dental, and vision insurance, 401(k) program with employer match, generous time off for vacation, and parental leave. To learn more, please visit https://www.redditinc.com/careers/.\n\nTo provide greater transparency to candidates, we share base pay ranges for all US-based job postings regardless of state. We set standard base pay ranges for all roles based on function, level, and country location, benchmarked against similar stage growth companies. Final offer amounts are determined by multiple factors including, skills, depth of work experience and relevant licenses/credentials, and may vary from the amounts listed below.\n\nThe base pay range for this position is: $       250300      - $    375500        .\n\n \n\nReddit is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at ApplicationAssistance@Reddit.com.",
        "remote": true,
        "remote_eligible": true,
        "apply_link": "https://boards.greenhouse.io/reddit/jobs/4977625",
        "premium": 0,
        "updated_at": "2023-05-12T00:26:52.988902+00:00",
        "created_at": "2023-05-12T00:26:52.988902+00:00",
        "verified": true,
        "type": "Full-time",
        "experience_level": "Senior",
        "keywords": null
    },
    {
        "id": "0cbbab6b-e9ee-49ff-a633-5b306458b1dc",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Backend Engineer (Desktop Platform) Backend Engineer (Desktop Platform)",
        "company": "Docker",
        "location": "Bulgaria, Spain, Sweden, France, Germany, Italy, Netherlands, Poland, Romania",
        "skills": [
            "go",
            "docker",
            "kubernetes",
            "linux",
            "ansible",
            "terraform",
            "postgres"
        ],
        "industry": "Software Development",
        "description": "Docker is a remote first company with employees across Europe and the Americas that simplifies the lives of developers who are making world-changing apps.  We raised our Series C funding in March 2022 for $105M at a $2.1B valuation. We continued to see exponential revenue growth last year.  Join us for a whale of a ride!\nDocker is looking for a new backend engineer to join our Europe-based Docker Desktop Platform Team. Docker Desktop is one of the core parts of the Docker suite. Every day, several million developers build their own software using our team’s products. Therefore this is an excellent opportunity to work on software for developers like you, with a huge market impact. You should be passionate about how developers’ lives could be made easier, and about Docker’s part in that.\nThe Docker Desktop Platform Team is one of several teams that help build Docker Desktop. Its specific role is to manage and improve internal tooling including the build and CI farm. It, therefore, serves internal customers (developers from other teams who are contributing to Docker Desktop). As an engineer in this team, you will work on Windows, Mac, and Linux. We program mainly in Go.\nResponsibilities:\nDesign, develop and maintain scalable and reliable tooling that supports teams contributing to our product.\nBring a positive attitude while fostering a collaborative and supportive environment that encourages open communication, constructive feedback, and a willingness to learn and grow.\nWrite high-quality code that is efficient, maintainable, and scalable.\nDon’t beat us too often at the games we play in our Friday Coffee session.\nQualifications:\nExperience as a backend software engineer.\nWillingness to program in Go. Previous experience programming in Go would be an advantage, but not essential.\nWillingness to develop on Windows, Mac, and Linux.\nExperience developing desktop applications would also be an advantage but is not essential.\nAbility to work remotely with other developers, UX Designers, and Product Management, both in your team and in other teams, some of whom may be in a different timezone.\nAbility to interact with our users and customers in a way that brings credit to Docker.\nWhat to expect in the first 30 days\nYou’ll get to meet your team and your assigned ‘buddy’ on day one. Your buddy will be one of your peers, and they will assist you through your onboarding process.\nYou will also be met with a thorough onboarding plan, that will guide you through all you need to know and set up.\nA chance to meet peers across Docker, within several virtual 1 on 1 coffee meetings.\nYou will be encouraged to start contributing work, by pairing up with a colleague on a work item, and by picking up tasks yourself.\nWhat to expect in the first 90 days\nTogether with your manager, you will set up an individual development plan.\nYou will be part of decisions that steer the team priorities and influence the quarterly roadmap, by actively participating in team workshops and discussions.\nYou will have the chance to interact and be visible outside the team, by doing demos of your work to all engineers at Docker, internal tech talks, and meeting and collaborating with internal customers (other developers).\nWhat to expect in the first year\nYou will take part in shaping the team vision for the next year.\nYou will positively impact the work that other developers do here, by the very nature of the work you and your team do - building and maintaining internal tooling that improves the productivity of teams contributing to Docker Desktop.\nYou’ll have the chance to meet your colleagues face to face in either team, department, or company-wide meetups.\nProvide feedback to your peers and manager in our 360 review process.\nPerks:\nFreedom & flexibility; fit your work around your life.\nVariety of virtual and in-person social events to build connections and have fun.\nHome office setup; we want you comfortable while you work.\nGenerous maternity and parental leave.\nTechnology stipend equivalent to $100 net/month.\nPTO plan that encourages you to take time to do the things you enjoy.\nWhaleness Days: companywide day off each month.\nQuarterly, company-wide hackathons.\nTraining stipend for conferences, courses, and classes.\nStock Options; we are a growing start-up and want all employees to have a share in the success of the company.\nDocker Swag.\nMedical benefits, retirement, and holidays vary by country.\nDocker embraces diversity and equal opportunity. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our company will be.\nEU Salary Range \n75,000 EUR - 112,000 EUR (salary range can change if hired in at a different level) \nDue to the remote nature of this role, we are unable to provide visa sponsorship.\n#LI-REMOTE",
        "remote": true,
        "remote_eligible": true,
        "apply_link": "https://www.docker.com/career-openings/?ashby_jid=238e633e-2425-4ed1-9a19-1d3bc32b0754",
        "premium": 1,
        "updated_at": "2023-05-11T22:43:41.36693+00:00",
        "created_at": "2023-05-11T22:43:41.36693+00:00",
        "verified": true,
        "type": "Full-time",
        "experience_level": "Senior",
        "keywords": null
    },
    {
        "id": "17b42a4c-c94c-4267-a7c8-14451ec9057c",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Senior Software Engineer - API Developer Experience",
        "company": "Discord",
        "location": "United States",
        "skills": [
            "typescript",
            "javascript",
            "rust",
            "python"
        ],
        "industry": "Software",
        "description": "What you'll be doing\n\n    Design, build, and ship delightful tools that have an outsized impact on Discord developers workflow and productivity.\n    Work with a team dedicated to building faster, reliable automations in CI pipelines, test frameworks, language tools and IDE integrations.\n    Leverage expertise and knowledge of the rapidly changing landscape of tooling and identify opportunities to apply them.\n    Partner with internal engineering teams to research pain points, identify bottlenecks and recognize patterns to provide tooling solutions from a product perspective.\n\nWhat you should have\n\n    5+ years of experience in software development with a focus on tooling, infrastructure, and API development.\n    Expertise in different development tools (CLI tools, build/deployment frameworks, IDEs, testing frameworks, etc.).\n    Broad experience with different API patterns and web frameworks that come from developing in a myriad of languages (we use Python, Typescript/Javascript, Rust, for example).\n    Ability to scope and prioritize tasks on ambiguous and complex technical projects.\n    Capability of considering specific technical tradeoffs to maximize impact for effort.\n    Curiosity and growth mindset to learn new technologies to solve interesting problems.\n\nBonus Points\n\n    You have familiarity with technologies we use including the Python ecosystem, Kubernetes, Docker, Google Cloud Platform, and Buildkite.\n    You have built open source software integrated by other developers.\n\nThe US base salary range for this full-time position is $190,000 to $204,000 + equity + benefits. Our salary ranges are determined by role and level. Within the range, individual pay is determined by additional factors, including job-related skills, experience, and relevant education or training. Please note that the compensation details listed in US role postings reflect the base salary only, and do not include equity, or benefits.\n\n#LI-Hybrid\nBenefits and Perks\n\n    Comprehensive medical insurance including Health, Dental and Vision (plus up to $20,000 for gender affirmation procedures)\n    Mental health resources and quarterly wellness stipends\n    16+ paid holidays, 4 weeks of PTO + use-what-you-need sick days \n    Paid parental leave (plus fertility, adoption and other family planning benefits)\n    Flexible long-term work options (remote and hybrid)\n    Volunteer time off\n    A diverse slate of Employee Resource Groups \n    Plus commuter contributions and other perks for office-based employees\n\nAbout Us\n\nDiscord is a voice, video and text app that helps friends and communities come together to hang out and explore their interests — from artists and activists, to study groups, sneakerheads, plant parents, and more. With 150 million monthly users across 19 million active communities, called servers, Discord has grown to become one of the most popular communications services in the world. Discord was built without selling ads or user data and instead, offers a premium subscription called Nitro that gives users special perks like higher quality streams and fun customizations.\n\nWe’re working toward an inclusive world where no one feels like an outsider, where genuine human connection is a click, text chat, or voice call away. A place where everyone can find belonging. Challenging? Heck yes. Rewarding? Double heck yes. It’s a mission that gives us the chance to positively impact millions of people all over the world. So if this strikes a chord with you, come build belonging with us!",
        "remote": true,
        "remote_eligible": true,
        "apply_link": "https://discord.com/jobs/6726751002",
        "premium": 0,
        "updated_at": "2023-05-13T02:25:51.940399+00:00",
        "created_at": "2023-05-13T02:25:51.940399+00:00",
        "verified": true,
        "type": "Full-time",
        "experience_level": "Mid-Senior",
        "keywords": null
    },
    {
        "id": "391fdbb1-1c46-4a5d-8837-2855e1eda659",
        "user_id": "5621335a-0b64-44f6-9534-24bb2c9eb86f",
        "title": "Security Program Manager",
        "company": "Instagram",
        "location": "United States",
        "skills": [
            "computer science",
            "information systems",
            "security",
            "project management"
        ],
        "industry": "Software",
        "description": "Responsibilities\nEngage with cross-functional stakeholders to define security, risk, and compliance requirements\nDemonstrate strong understanding of the supported domain and conduct deep analysis of the problem space\nLead cross-functional teams through full program lifecycles by defining scope/success criteria, setting expectations, establishing timelines, implementing solutions, and measuring success and lessons learned\nDefine processes end-to-end and drive improvements for maximum impact\nOperationalize strategic security programs by making them efficient, scalable, and reliable\nDevelop, implement, and iterate on program management procedures, frameworks, and metrics to achieve business goals with defined success criteria\nIdentify program risks and drive the implementation of recommended mitigations\nDrive cross-functional and effective communications throughout the program lifecycle, providing the visibility and transparency required to ensure cross-functional team and stakeholder alignment\nEnsure smooth transitions of programs we are receiving or handing off\nDevelop, define and report on program health and success metrics\nBe independent, results oriented, and thorough in examination and analysis\nAdaptable to dynamic situations and proactive work ethic\nMinimum Qualifications\nBA/BS in Computer Science, Information Systems, or similar field (or BA/BS in Business with a minor in Computer Science, Information Systems, or similar field), or equivalent work experience\n7+ years of work experience in information security, program/project management, or similar capacities\nAnalytical, problem-solving, negotiation and organizational skills with a clear experience focusing under pressure\nExperience driving projects end-to-end independently, including evaluating, defining and improving end-to-end processes\nExperience influencing stakeholders and partner teams, especially in collaborating with different individuals across the organization\nCommunication skills across technical and non-technical stakeholders and attention to detail\nExperience managing competing priorities and simultaneous/concurrent projects in a fast-paced environment\nPreferred Qualifications\nSANS or CISSP certification in areas of Security strategy & roadmap development, Enterprise security, Access Management, and Risk Management\nFamiliarity or experience with compliance programs such as GDPR, ISO 27001, IS0 27018, SOC 2 and PCI",
        "remote": true,
        "remote_eligible": false,
        "apply_link": "https://about.instagram.com/careers/1284808652077643/",
        "premium": 0,
        "updated_at": "2023-05-13T03:01:23.604978+00:00",
        "created_at": "2023-05-13T03:01:23.604978+00:00",
        "verified": true,
        "type": "Full-time",
        "experience_level": "Mid-Senior",
        "keywords": null
    }
]